import { search1, search2, search3, search4, search5 } from "./index";

describe("查找等于给定值的元素", () => {
  test("[2,5,9,10,12,17] 5", () => {
    expect(search1([2, 5, 9, 10, 12, 17], 5)).toBe(1);
  });
});

describe("查找最后一个等于给定值的元素", () => {
  test("[2,5,5,5,5,5,5,5,7,10]", () => {
    expect(search2([2, 5, 5, 5, 5, 5, 5, 5, 7, 10], 5)).toBe(7);
  });
});

describe("查找第一个等于给定值的元素", () => {
  test("[2,5,5,5,5,5,5,7,10]", () => {
    expect(search3([2, 5, 5, 5, 5, 5, 5, 7, 10], 5)).toBe(1);
  });
});

describe("查找第一个大于等于给定值的元素", () => {
  test("[2,6,9,10] 5", () => {
    expect(search4([2, 6, 9, 10], 5)).toBe(1);
  });

  test("[2,6,9,10] 1", () => {
    expect(search4([2, 6, 9, 10], 1)).toBe(0);
  });

  test("[1,9,20,24,28,30,48] 31", () => {
    expect(search4([1, 9, 20, 24, 28, 30, 48], 31)).toBe(6);
  });
});

describe("查找最后一个小于等于给定值的元素", () => {
  test("[1,5,9,10,20,30,40],6", () => {
    expect(search5([1, 5, 9, 10, 20, 30, 40], 6)).toBe(1);
  });
});
